#### 교재 + Flearning 강의(https://www.flearning.net/classes/15)

### Pandas Library

- 복잡한 자료구조와 유용한 데이터 분석 도구를 포함
- 축의 이름에 따라 데이터를 정렬할 수 있는 자료 구조.
- 통합된 시계열 기능
- 시계열 데이터 + 비시계열 데이터를 다룰 수 있는 통합 자료 구조
- 누락된 데이터를 유연하게 처리할 수 있는 기능
- DB에서처럼 데이터를 합치고 관계연산을 수행하는 기능

# Introduction to pandas Data Structures

In [1]:
# pandas 모듈과 numpy 모듈을 import한 후, 객체 생성.
import numpy as np
import pandas as pd

In [2]:
# pandas 모듈 내의 Series class, DataFrame class, MultiIndex class를 import.
from pandas import Series, DataFrame, MultiIndex

# 이 작업 안 할꺼면 pd 객체를 통해 필요할 때마다 불러와도 된다.

### Series

- 동일한 데이터형의 복수 개의 성분으로 구성된 자료 구조
- index라고 하는 배열의 데이터에 연관된 이름을 가지고 있다.
- **다른말로 고정 길이의 정렬된 사전형
- 리스트나 numpy array 등이 함수의 인자로 입력

In [3]:
# index는 default로 0부터 N-1
obj=Series([4, 7, -5, 3])
obj

0    4
1    7
2   -5
3    3
dtype: int64

In [5]:
# index 값 지정
obj2=Series([4, 7, -5, 3], index=['d', 'b', 'a', 'c'])
obj2

d    4
b    7
a   -5
c    3
dtype: int64

In [6]:
obj2.values

array([ 4,  7, -5,  3], dtype=int64)

In [7]:
obj2.index

Index(['d', 'b', 'a', 'c'], dtype='object')

In [8]:
obj2['d'] # index 값을 이용

4

In [9]:
obj2[0] # index 위치를 이용

4

In [10]:
obj2['d'] = 6
obj2

d    6
b    7
a   -5
c    3
dtype: int64

###### Boolean Series

In [11]:
'b' in obj2

True

In [12]:
'e' in obj2

False

In [13]:
obj2>0 # boolean Series 출력. 이를 마스크라고 부른다.

d     True
b     True
a    False
c     True
dtype: bool

In [14]:
obj2[obj2>0]

d    6
b    7
c    3
dtype: int64

In [15]:
obj2*2

d    12
b    14
a   -10
c     6
dtype: int64

In [16]:
np.exp(obj2)

d     403.428793
b    1096.633158
a       0.006738
c      20.085537
dtype: float64

In [23]:
exp = [2.718281**(6),2.718281**(7),2.718281**(-5),2.718281**(3)]
exp

[403.42805576795286,
 1096.6308188609667,
 0.0067379572668181615,
 20.085518558602185]

###### Series 다루기

In [24]:
# dict's key → index로 들어감(알파벳순 자동정렬)
sdata = {'Ohio':35000, 'Texas':71000, 'Oregon':16000, 'Utah':5000}
obj3 = Series(sdata)
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [25]:
# index 값 지정 (지정되지 않은 데이터는 잃어버림)
states = ['California','Ohio','Oregon','Texas']
obj4 = Series(sdata, index=states)
obj4 # NaN(not a number = missing values = NA values) 할당

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [26]:
# 결측치 확인
pd.isnull(obj4)

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [27]:
obj4.isnull() # Series의 instance method를 호출하는 방법

California     True
Ohio          False
Oregon        False
Texas         False
dtype: bool

In [28]:
obj4.notnull()

California    False
Ohio           True
Oregon         True
Texas          True
dtype: bool

In [29]:
obj3

Ohio      35000
Oregon    16000
Texas     71000
Utah       5000
dtype: int64

In [30]:
obj4

California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
dtype: float64

In [31]:
# Series는 산술연산시, 다르게 인덱싱된 데이터를 자동으로 정렬함
obj3+obj4

California         NaN
Ohio           70000.0
Oregon         32000.0
Texas         142000.0
Utah               NaN
dtype: float64

In [32]:
# 이름(제목)지정
obj4.name='population'
obj4.index.name='state'
obj4

state
California        NaN
Ohio          35000.0
Oregon        16000.0
Texas         71000.0
Name: population, dtype: float64

## DataFrame

- 서로 같거나 다른 데이터형의 여러 개의 열에 대하여 복수 개의 성분으로 구성된 '표와 같은 형태'의 자료 구조
- input가능한 자료형
    1. 2차원 ndarray
    2. array,list,tuple의 dictionary
    3. NumPy의 구조화 배열
    4. Series 사전
    5. 사전의 사전
    6. 사전이나 Series의 리스트
    7. 리스트나 튜플의 리스트
    8. 다른 DataFrame
    9. NumPy MaskedArray

#### 1) list로 이루어진 dictionary로 DataFrame 만들기

In [33]:
# column은 알파벳순으로 자동정렬
data={'state':['Ohio','Ohio','Ohio','Nevada','Nevada'],
     'year':[2000,2001,2002,2001,2002],
     'pop':[1.5,1.7,3.6,2.4,2.9]}
df=DataFrame(data)
df

   pop   state  year
0  1.5    Ohio  2000
1  1.7    Ohio  2001
2  3.6    Ohio  2002
3  2.4  Nevada  2001
4  2.9  Nevada  2002

In [34]:
# column 순서 임의 지정
df1=DataFrame(data, columns=['year','state','pop'])
df1

   year   state  pop
0  2000    Ohio  1.5
1  2001    Ohio  1.7
2  2002    Ohio  3.6
3  2001  Nevada  2.4
4  2002  Nevada  2.9

In [35]:
# index 값 지정
df2=DataFrame(data, columns=['year','state','pop'],
              index=['one','two','three','four','five'])
df2

       year   state  pop
one    2000    Ohio  1.5
two    2001    Ohio  1.7
three  2002    Ohio  3.6
four   2001  Nevada  2.4
five   2002  Nevada  2.9

In [36]:
# 새로운 column 입력하면, missing values 자동 할당
df3=DataFrame(data, columns=['year','state','pop','debt'], index=['one','two','three','four','five'])
df3

       year   state  pop debt
one    2000    Ohio  1.5  NaN
two    2001    Ohio  1.7  NaN
three  2002    Ohio  3.6  NaN
four   2001  Nevada  2.4  NaN
five   2002  Nevada  2.9  NaN

In [37]:
# column명 확인
df3.columns

Index(['year', 'state', 'pop', 'debt'], dtype='object')

- 행 또는 열 추출 (ix[], loc[], iloc[] 기능 비교하기)

In [38]:
# column
df3['state']
df3.state

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [39]:
df3.loc[:,'state'] # label 을 이용 (실제 index의 이름을 사용)

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [40]:
df3.iloc[:,1] # position 을 이용 (numpy의 array indexing 방식)

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [41]:
df3.ix[:,'state'] # label, position 둘다 이용 (단, label이 우선순위)

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [42]:
df3.ix[:,1]

one        Ohio
two        Ohio
three      Ohio
four     Nevada
five     Nevada
Name: state, dtype: object

In [43]:
# row
df3[2] #KeyError

KeyError: 2

In [44]:
df3[:2]
# dataframe[~] 하면 column을 가져오지만, :2 로 표현을 하니 index를 가져온다.
# 개발자 마음인 것 같네요. 따라야지요. 그러니 해보면서 어떤 방법들이 있는지 스스로 공부해 봅시다!

     year state  pop debt
one  2000  Ohio  1.5  NaN
two  2001  Ohio  1.7  NaN

In [45]:
# 함수를 사용하면 index만 표현하는 것이 가능.
df3.loc['two']

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [46]:
df3.loc['two',:]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [47]:
df3.iloc[1,:]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [48]:
df3.ix['two',:]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

In [49]:
df3.ix[1,:]

year     2001
state    Ohio
pop       1.7
debt      NaN
Name: two, dtype: object

- column에 값 할당하기

In [50]:
# 스칼라 할당
df3['debt']=16.5
df3

       year   state  pop  debt
one    2000    Ohio  1.5  16.5
two    2001    Ohio  1.7  16.5
three  2002    Ohio  3.6  16.5
four   2001  Nevada  2.4  16.5
five   2002  Nevada  2.9  16.5

In [51]:
# array 할당
df3['debt']=np.arange(5.)
df3

       year   state  pop  debt
one    2000    Ohio  1.5   0.0
two    2001    Ohio  1.7   1.0
three  2002    Ohio  3.6   2.0
four   2001  Nevada  2.4   3.0
five   2002  Nevada  2.9   4.0

In [52]:
# series 할당 (데이터와 index의 길이는 같아야 한다.)
val = Series([-1.2, -1.5, -1.7], index=['two', 'four', 'five'])
df3['debt'] = val
df3
# DataFrame 보다 val이 크면 데이터를 잃는다.

       year   state  pop  debt
one    2000    Ohio  1.5   NaN
two    2001    Ohio  1.7  -1.2
three  2002    Ohio  3.6   NaN
four   2001  Nevada  2.4  -1.5
five   2002  Nevada  2.9  -1.7

In [53]:
# new column 생성
df3['eastern'] = (df3.state == 'Ohio')
df3

       year   state  pop  debt eastern
one    2000    Ohio  1.5   NaN    True
two    2001    Ohio  1.7  -1.2    True
three  2002    Ohio  3.6   NaN    True
four   2001  Nevada  2.4  -1.5   False
five   2002  Nevada  2.9  -1.7   False

In [54]:
# column 삭제
del df3['debt']
df3

       year   state  pop eastern
one    2000    Ohio  1.5    True
two    2001    Ohio  1.7    True
three  2002    Ohio  3.6    True
four   2001  Nevada  2.4   False
five   2002  Nevada  2.9   False

#### 2) 중첩된 dictionary로 DataFrame 만들기

In [55]:
# outer keys → column 명
# inner keys → row 명
pop = {'Nevada' : {2001:2.4, 2002:2.9},
       'Ohio' : {2000:1.5, 2001:1.7, 2002:3.6}}
df4 = DataFrame(pop)
df4

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7
2002     2.9   3.6

In [56]:
# transpose
df4.T

        2000  2001  2002
Nevada   NaN   2.4   2.9
Ohio     1.5   1.7   3.6

In [57]:
# index 값 지정 (NaN)
df5 = DataFrame(pop, index=[2001,2002,2003])
df5

      Nevada  Ohio
2001     2.4   1.7
2002     2.9   3.6
2003     NaN   NaN

In [58]:
# DataFrame indexing
pdata = {'Ohio':df4['Ohio'][:-1],
         'Nevada':df4['Nevada'][:2]}
df6 = DataFrame(pdata)
df6

      Nevada  Ohio
2000     NaN   1.5
2001     2.4   1.7

In [59]:
# index와 column 이름 지정
df4.index.name = 'year'
df4.columns.name = 'state'
df4

state  Nevada  Ohio
year
2000      NaN   1.5
2001      2.4   1.7
2002      2.9   3.6

In [60]:
df4.values

array([[ nan,  1.5],
       [ 2.4,  1.7],
       [ 2.9,  3.6]])

## Index Object

- 색인 객체는 표 형식의 데이터에서 각 row와 column에 대한 값을 저장하는 객체이다.
- 색인 객체는 변경할 수 없어 자료 구조 사이에서 안전하게 공유된다.
- pandas에서 사용되는 내장 색인 클래스가 정의되어 있다.
- 특수한 목적으로 축을 색인하는 기능을 개발하기 위해 Index 클래스의 서브클래스를 만들 수 있다.

In [61]:
obj = Series(range(3), index=['a', 'b', 'c'])
obj

a    0
b    1
c    2
dtype: int32

In [62]:
obj.index[1] = 'c' # index object 는 변경 불가

TypeError: Index does not support mutable operations

#### Index클래스의 서브클래스 생성 가능
- pandas의 주요 index 객체 : Index, Int64Index, MultiIndex, DatetimeIndex, PeriodIndex

In [63]:
index1 = pd.Index(np.arange(3))
index1

Int64Index([0, 1, 2], dtype='int64')

#### 색인 메서드와 속성
- 각각의 색인은 담고있는 데이터에 대한 정보를 취급하는 여러가지 메서드와 속성을 갖고 있음

<ol>
<li>append</li>
<li>diff / intersection / union</li>
<li>isin</li>
<li>delete</li>
<li>drop</li>
<li>insert</li>
<li>is_monotonic</li>
<li>unique</li>
</ol>

#### index 다루기

In [64]:
obj=Series(np.arange(4.), index=['a','b','c','d'])
obj

a    0.0
b    1.0
c    2.0
d    3.0
dtype: float64

In [65]:
# 두 결과를 비교하자.
print (obj[2:3]);print()
print (obj["c":"d"])

c    2.0
dtype: float64

c    2.0
d    3.0
dtype: float64

In [66]:
# 띄엄띄엄 있는 index를 가져올 때, [] 를 이용하자.
print (obj[[1,3]]);print()
print (obj[["b","d"]])

b    1.0
d    3.0
dtype: float64

b    1.0
d    3.0
dtype: float64

In [67]:
data=DataFrame(np.arange(16.).reshape((4,4)),
              index=['Ohio','Colorado','Utah','New Yourk'],
              columns=['one','two','three','four'])
data

            one   two  three  four
Ohio        0.0   1.0    2.0   3.0
Colorado    4.0   5.0    6.0   7.0
Utah        8.0   9.0   10.0  11.0
New Yourk  12.0  13.0   14.0  15.0

In [68]:
data['two']

Ohio          1.0
Colorado      5.0
Utah          9.0
New Yourk    13.0
Name: two, dtype: float64

In [69]:
# 둘 이상의 column을 불러오고 싶을 때, []를 사용하자.
data[['three','one']]

           three   one
Ohio         2.0   0.0
Colorado     6.0   4.0
Utah        10.0   8.0
New Yourk   14.0  12.0

In [70]:
# 둘의 출력값이 같다는 것을 확인할 수 있다.
print (data.ix['Colorado', ['two','three']]);print()
print (data.ix[1, 1:3])

two      5.0
three    6.0
Name: Colorado, dtype: float64

two      5.0
three    6.0
Name: Colorado, dtype: float64

In [71]:
print (data.loc['Colorado', ['two','three']]);print()
print (data.iloc[1, 1:3])

two      5.0
three    6.0
Name: Colorado, dtype: float64

two      5.0
three    6.0
Name: Colorado, dtype: float64

In [72]:
# label과 position 함께 사용 가능하다.
print (data.ix[['Colorado','Utah'],[3,0,1]]);print()
print (data.ix[1:3, ['four','one','two']])

          four  one  two
Colorado   7.0  4.0  5.0
Utah      11.0  8.0  9.0

          four  one  two
Colorado   7.0  4.0  5.0
Utah      11.0  8.0  9.0

In [73]:
# boolean Series(마스크)를 이용한 색인이 가능!
print (data.three > 5);print()
print (data.ix[data.three > 5, :3]);print()
print (data.ix[data.three > 5, 'one':'three'])

Ohio         False
Colorado      True
Utah          True
New Yourk     True
Name: three, dtype: bool

            one   two  three
Colorado    4.0   5.0    6.0
Utah        8.0   9.0   10.0
New Yourk  12.0  13.0   14.0

            one   two  three
Colorado    4.0   5.0    6.0
Utah        8.0   9.0   10.0
New Yourk  12.0  13.0   14.0

#### Table 5-6
- obj[val] : select columns or sequence columns from dataframe
- obj.ix[val] : select single row of subset of rows
- obj.ix[:, val] : select single column of subset of columns
- obj.ix[val1, val2] : select both rows and columns

##### Arithmetic and data alignment
- pandas의 가장 큰 특징은 index가 다른 두 변수의 산술(arithmetic)이 가능하다는 것

In [74]:
s1 = Series([7.3,-2.5,3.4,1.5], index=['a','c','d','e'])
s2 = Series([-2.1,3.6,-1.5,4,3.1], index=['a','c','e','f','g'])
print (s1);print()
print (s2)

a    7.3
c   -2.5
d    3.4
e    1.5
dtype: float64

a   -2.1
c    3.6
e   -1.5
f    4.0
g    3.1
dtype: float64

In [75]:
s1 + s2 # NaN 할당

a    5.2
c    1.1
d    NaN
e    0.0
f    NaN
g    NaN
dtype: float64

In [76]:
df1 = DataFrame(np.arange(9.).reshape((3,3)), columns=list('bcd'),
                index=["Ohio","Texas","Colorado"])
df2 = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                index=["Utah","Ohio","Texas","Oregon"])
print (df1);print()
print (df2)

            b    c    d
Ohio      0.0  1.0  2.0
Texas     3.0  4.0  5.0
Colorado  6.0  7.0  8.0

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [77]:
df1 + df2 # NaN 할당

            b   c     d   e
Colorado  NaN NaN   NaN NaN
Ohio      3.0 NaN   6.0 NaN
Oregon    NaN NaN   NaN NaN
Texas     9.0 NaN  12.0 NaN
Utah      NaN NaN   NaN NaN

##### Arithmetic methods with fill vaules

In [78]:
df1 = DataFrame(np.arange(12.).reshape((3,4)), columns=list('abcd'))
df2 = DataFrame(np.arange(20.).reshape((4,5)), columns=list('abcde'))
print (df1);print()
print (df2)

     a    b     c     d
0  0.0  1.0   2.0   3.0
1  4.0  5.0   6.0   7.0
2  8.0  9.0  10.0  11.0

      a     b     c     d     e
0   0.0   1.0   2.0   3.0   4.0
1   5.0   6.0   7.0   8.0   9.0
2  10.0  11.0  12.0  13.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [79]:
df1+df2

      a     b     c     d   e
0   0.0   2.0   4.0   6.0 NaN
1   9.0  11.0  13.0  15.0 NaN
2  18.0  20.0  22.0  24.0 NaN
3   NaN   NaN   NaN   NaN NaN

In [80]:
# add() 함수, fill_value 인자 사용
df1.add(df2, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [81]:
df2.add(df1, fill_value=0)

      a     b     c     d     e
0   0.0   2.0   4.0   6.0   4.0
1   9.0  11.0  13.0  15.0   9.0
2  18.0  20.0  22.0  24.0  14.0
3  15.0  16.0  17.0  18.0  19.0

In [ ]:
# reindex() 함수, fill_value 인자 사용
df1.reindex(columns=df2.columns, fill_value=0)

# 단, add() 함수와는 다른 결과 출력.

#### cf. 순차적인 데이터(시계열)를 재색인 할 때  method 인자를 이용해 값을 보간하거나 채워 넣기
- ffill or pad : 앞의 값으로 누락된 값을 채워 넣는다.
- bfill or backfill : 뒤의 값으로 채워 넣는다.

In [82]:
obj3 = Series(['blue', 'purple', 'yellow'], index=[0, 2, 4])
obj3

0      blue
2    purple
4    yellow
dtype: object

In [83]:
obj3.reindex(range(6), method='ffill')

0      blue
1      blue
2    purple
3    purple
4    yellow
5    yellow
dtype: object

##### Operations between DataFrame and Series

In [84]:
frame = DataFrame(np.arange(12.).reshape((4,3)), columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])
series=frame.ix[0]

In [85]:
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [86]:
series

b    0.0
d    1.0
e    2.0
Name: Utah, dtype: float64

In [87]:
frame - series

# frame의 각 index에 Utah 행의 데이터 만큼을 빼준다.

          b    d    e
Utah    0.0  0.0  0.0
Ohio    3.0  3.0  3.0
Texas   6.0  6.0  6.0
Oregon  9.0  9.0  9.0

In [88]:
series2 = Series(range(3), index=['b','e','f'])
series2

b    0
e    1
f    2
dtype: int32

In [89]:
frame + series2

# pandas의 경우 index가 맞는 경우에 연산이 잘 나오는 것을 확인할 수 있다.

          b   d     e   f
Utah    0.0 NaN   3.0 NaN
Ohio    3.0 NaN   6.0 NaN
Texas   6.0 NaN   9.0 NaN
Oregon  9.0 NaN  12.0 NaN

In [90]:
# 모든 column에 연산을 갖게 해주는 여러 방법중에 한가지를 알아보자. (단, dataframe과 series는 같은 길이) 
frame

          b     d     e
Utah    0.0   1.0   2.0
Ohio    3.0   4.0   5.0
Texas   6.0   7.0   8.0
Oregon  9.0  10.0  11.0

In [91]:
series3 = frame['d']
series3

Utah       1.0
Ohio       4.0
Texas      7.0
Oregon    10.0
Name: d, dtype: float64

In [92]:
frame.sub(series3, axis=0)

          b    d    e
Utah   -1.0  0.0  1.0
Ohio   -1.0  0.0  1.0
Texas  -1.0  0.0  1.0
Oregon -1.0  0.0  1.0

In [93]:
frame.mul(series3, axis=0)

           b      d      e
Utah     0.0    1.0    2.0
Ohio    12.0   16.0   20.0
Texas   42.0   49.0   56.0
Oregon  90.0  100.0  110.0

##### Function application and mapping
- pandas 객체에도 Numpy의 universal functions(배열의 각 원소에 적용되는 메서드)를 적용할 수 있다.
- 다만 numpy에서와 달리 pandas에서는 정수가 아닌 indexing이 가능하다는 차이가 있음을 기억하자.

In [94]:
frame = DataFrame(np.random.randn(4,3), columns=list('bde'),
                 index=['Utah','Ohio','Texas','Oregon'])
frame

               b         d         e
Utah   -0.540401 -0.269823  0.525974
Ohio    0.843712 -0.634231 -1.649494
Texas   1.367834 -0.534727 -1.821127
Oregon -0.636029 -0.217170 -1.233866

In [95]:
np.abs(frame)

               b         d         e
Utah    0.540401  0.269823  0.525974
Ohio    0.843712  0.634231  1.649494
Texas   1.367834  0.534727  1.821127
Oregon  0.636029  0.217170  1.233866

In [96]:
# lambda 함수를 정의한 뒤 이를 f 변수에 저장 -> f 함수 생성 (사용자 정의 함수) 
f= lambda x: x.max() - x.min()

In [98]:
frame

               b         d         e
Utah   -0.540401 -0.269823  0.525974
Ohio    0.843712 -0.634231 -1.649494
Texas   1.367834 -0.534727 -1.821127
Oregon -0.636029 -0.217170 -1.233866

In [99]:
#  apply 함수를 이용해 함수 f를 DataFrame에 사용
# R : 1-row, 2-col vs Python : 0-column, 1-index

frame.apply(f) # Column을 기준으로 한다. <default : axis=0>

b    2.003863
d    0.417061
e    2.347101
dtype: float64

In [100]:
frame.apply(f, axis=1)
# axis = 1은 Index를 기준으로 함수 적용

Utah      1.066375
Ohio      2.493206
Texas     3.188961
Oregon    1.016696
dtype: float64

In [101]:
# axis 추가 예제
frame.drop(['Utah', 'Texas'])

               b         d         e
Ohio    0.843712 -0.634231 -1.649494
Oregon -0.636029 -0.217170 -1.233866

In [102]:
frame.drop('d',axis=1)

               b         e
Utah   -0.540401  0.525974
Ohio    0.843712 -1.649494
Texas   1.367834 -1.821127
Oregon -0.636029 -1.233866

In [103]:
frame.drop('d',1) # 위치에 의한 인수입력 방식도 가능.

               b         e
Utah   -0.540401  0.525974
Ohio    0.843712 -1.649494
Texas   1.367834 -1.821127
Oregon -0.636029 -1.233866

In [104]:
def f(x):
    return Series([x.min(), x.max()], index=['min','max'])

frame.apply(f)
# b/d/e의 최소, 최대값을 갖는 Series 반환

            b         d         e
min -0.636029 -0.634231 -1.821127
max  1.367834 -0.217170  0.525974

In [105]:
frame

               b         d         e
Utah   -0.540401 -0.269823  0.525974
Ohio    0.843712 -0.634231 -1.649494
Texas   1.367834 -0.534727 -1.821127
Oregon -0.636029 -0.217170 -1.233866

In [106]:
# 만약 element-wise 함수를 적용시키려면
# applymap()함수 이용

format = lambda x: '%.2f' % x
frame.applymap(format)

            b      d      e
Utah    -0.54  -0.27   0.53
Ohio     0.84  -0.63  -1.65
Texas    1.37  -0.53  -1.82
Oregon  -0.64  -0.22  -1.23

In [107]:
# 하나의 column에만 적용하고 싶을때는 map()함수 이용
frame['b'].map(format)

Utah      -0.54
Ohio       0.84
Texas      1.37
Oregon    -0.64
Name: b, dtype: object

##### Sorting

In [108]:
# sort_index() : index를 정렬(문자인 경우abcde...순)
obj = Series(range(4), index=['d','a','b','c'])
obj

d    0
a    1
b    2
c    3
dtype: int32

In [109]:
obj.sort_index()

a    1
b    2
c    3
d    0
dtype: int32

In [110]:
# DataFrame 에서도 sort_index() 함수 사용
frame = DataFrame(np.arange(8.).reshape((2,4)), index=['three','one'],
                 columns=['d','a','b','c'])
frame

         d    a    b    c
three  0.0  1.0  2.0  3.0
one    4.0  5.0  6.0  7.0

In [111]:
frame.sort_index()

         d    a    b    c
one    4.0  5.0  6.0  7.0
three  0.0  1.0  2.0  3.0

In [112]:
frame.sort_index(axis=1)

         a    b    c    d
three  1.0  2.0  3.0  0.0
one    5.0  6.0  7.0  4.0

In [113]:
# 만약 내림차순으로 정렬하고 싶다면, ascending=False 인자 추가
frame.sort_index(axis=1, ascending=False)

         d    c    b    a
three  0.0  3.0  2.0  1.0
one    4.0  7.0  6.0  5.0

In [114]:
# order() 함수 : 값에 따른 정렬
obj = Series([4,7,-3,2])
obj

0    4
1    7
2   -3
3    2
dtype: int64

In [115]:
obj.order() # index는 섞인다.

C:\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: order is deprecated, use sort_values(...)
  if __name__ == '__main__':

2   -3
3    2
0    4
1    7
dtype: int64

In [116]:
# missing value 는 맨뒤로!
obj = Series([4, np.nan, 7, np.nan, -3, 2])
obj.order()

C:\Anaconda3\lib\site-packages\ipykernel\__main__.py:3: FutureWarning: order is deprecated, use sort_values(...)
  app.launch_new_instance()

4   -3.0
5    2.0
0    4.0
2    7.0
1    NaN
3    NaN
dtype: float64

In [117]:
# 내림차순도 마찬가지
obj.order(ascending=False)

C:\Anaconda3\lib\site-packages\ipykernel\__main__.py:2: FutureWarning: order is deprecated, use sort_values(...)
  from ipykernel import kernelapp as app

2    7.0
0    4.0
5    2.0
4   -3.0
1    NaN
3    NaN
dtype: float64

In [118]:
frame = DataFrame({'b':[4,7,-3,2], 'a':[0,1,0,1]})
frame

   a  b
0  0  4
1  1  7
2  0 -3
3  1  2

In [119]:
frame.sort_index(by='b') # 기준 지정

C:\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
3  1  2
0  0  4
1  1  7

In [120]:
frame.sort_index(by=['a','b']) # a 먼저 정렬

C:\Anaconda3\lib\site-packages\ipykernel\__main__.py:1: FutureWarning: by argument to sort_index is deprecated, pls use .sort_values(by=...)
  if __name__ == '__main__':

   a  b
2  0 -3
0  0  4
3  1  2
1  1  7

#### Ranking
- 작은값부터 rank : 1
- sorting과 밀접하게 관련
- numpy.argsort 과 비슷한 형태

In [121]:
obj = Series([7,-5,7,4,2,0,4])
obj

0    7
1   -5
2    7
3    4
4    2
5    0
6    4
dtype: int64

In [122]:
# 만약 같은 값이 있다면, default는 두 순위의 평균값으로 한다. (여기서는 (6+7)/2=6.5를 사용)
obj.rank()

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [123]:
obj.rank(method='average') # default

0    6.5
1    1.0
2    6.5
3    4.5
4    3.0
5    2.0
6    4.5
dtype: float64

In [124]:
# 같은 값의 경우 먼저 쓰여진 것(index가 낮은 것)을 작은 값으로 인식
obj.rank(method='first')

0    6.0
1    1.0
2    7.0
3    4.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [125]:
# 같은 값의 경우 큰 값으로 인식
obj.rank(method='max')

0    7.0
1    1.0
2    7.0
3    5.0
4    3.0
5    2.0
6    5.0
dtype: float64

In [126]:
# 같은 값의 경우 작은 값으로 인식
obj.rank(method='min')

0    6.0
1    1.0
2    6.0
3    4.0
4    3.0
5    2.0
6    4.0
dtype: float64

In [127]:
# rank도 내림차순 가능
obj.rank(method='max', ascending=False)

0    2.0
1    7.0
2    2.0
3    4.0
4    5.0
5    6.0
6    4.0
dtype: float64

In [128]:
# DataFrame에서도 ranking 가능
frame = DataFrame({'b':[4.3,7,-3,2],'a':[0,1,0,1],
                  'c':[-2,5,8,-2.5]})
frame

   a    b    c
0  0  4.3 -2.0
1  1  7.0  5.0
2  0 -3.0  8.0
3  1  2.0 -2.5

In [129]:
frame.rank() #(default)axis=0, Column을 기준으로 Index 방향으로 진행

     a    b    c
0  1.5  3.0  2.0
1  3.5  4.0  3.0
2  1.5  1.0  4.0
3  3.5  2.0  1.0

In [130]:
frame.rank(axis=1) # axis=1

     a    b    c
0  2.0  3.0  1.0
1  1.0  3.0  2.0
2  2.0  1.0  3.0
3  2.0  3.0  1.0

##### Axis indexes with duplicate values

In [131]:
# 만약 index값이 중복된다면?
obj = Series(range(5), index=['a','a','b','b','c'])
obj

a    0
a    1
b    2
b    3
c    4
dtype: int32

In [132]:
obj.index.is_unique

False

In [133]:
obj.index.unique() # 참고

array(['a', 'b', 'c'], dtype=object)

In [134]:
obj['a'] # 모두 출력

a    0
a    1
dtype: int32

In [135]:
# DataFrame의 경우도 같다
df = DataFrame(np.random.randn(4,3),index=['a','a','b','b'])
df

          0         1         2
a  0.930328  0.201371 -0.598438
a -0.300528  0.837309  0.071464
b -0.520036  0.315675 -1.365491
b  1.273163 -1.618358 -0.862908

In [136]:
df.ix['b'] # 모두 출력

          0         1         2
b -0.520036  0.315675 -1.365491
b  1.273163 -1.618358 -0.862908

##### Summarizing and Computing Descriptive Statistics
- pandas object는 보통 수학계산과 통계계산이 가능하다.
- pandas의 수학, 통계 메서드는 기본적으로 누락된 데이터를 제외하도록 설계되었다.

#### pandas의 DataFrame에 적용되는 통계함수 정리
- count	            : 전체 성분의 (NaN이 아닌) 값의 갯수를 계산
- min, max      	: 전체 성분의 최솟, 최댓값을 계산
- argmin, argmax	: 전체 성분의 최솟값, 최댓값이 위치한 (정수)인덱스를 반환
- idxmin, idxmax	: 전체 인덱스 중 최솟값, 최댓값을 반환
- quantile         	: 전체 성분의 특정 사분위수에 해당하는 값을 반환 (0~1 사이)
- sum           	: 전체 성분의 합을 계산
- mean          	: 전체 성분의 평균을 계산
- median	        : 전체 성분의 중간값을 반환
- mad	            : 전체 성분의 평균값으로부터의 절대 편차의 평균을 계산
- std, var      	: 전체 성분의 표준편차, 분산을 계산
- cumsum	        : 맨 첫 번째 성분부터 각 성분까지의 누적합을 계산 (0에서부터 계속 더해짐)
- cumprod       	: 맨 첫번째 성분부터 각 성분까지의 누적곱을 계산 (1에서부터 계속 곱해짐)

In [137]:
df = DataFrame([[1.4,np.nan],[7.1,-4.5],
               [np.nan, np.nan],[0.75,-1.3]],
              index=['a','b','c','d'],
              columns=['one','two'])
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [138]:
df.sum()

one    9.25
two   -5.80
dtype: float64

In [139]:
df.sum(axis=1)

a    1.40
b    2.60
c    0.00
d   -0.55
dtype: float64

In [140]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [141]:
# skipna 인자를 이용해 NA를 통제할 수 있다.
df.mean(axis=1, skipna=False)

a      NaN
b    1.300
c      NaN
d   -0.275
dtype: float64

In [142]:
df.mean(axis=1, skipna=True)

a    1.400
b    1.300
c      NaN
d   -0.275
dtype: float64

In [143]:
df

    one  two
a  1.40  NaN
b  7.10 -4.5
c   NaN  NaN
d  0.75 -1.3

In [144]:
df.idxmax() # column 기준으로 가장 큰 값의 index 반환

one    b
two    d
dtype: object

In [145]:
df.idxmax(axis=1) # index 기준으로 가장 큰 값의 column 반환

a    one
b    one
c    NaN
d    one
dtype: object

In [148]:
# 계산이 가능한 컬럼에 한해서 각 컬럼의 평균, 분산, 최솟/최댓값 등 기본 통계량을 산출한 결과 출력
# 데이터셋을 DataFrame 형태로 막 읽어들인 직후, 데이터셋을 전체적으로 살펴보고자 할 때 유용

df.describe()

C:\Anaconda3\lib\site-packages\numpy\lib\function_base.py:3834: RuntimeWarning: Invalid value encountered in percentile
  RuntimeWarning)

            one       two
count  3.000000  2.000000
mean   3.083333 -2.900000
std    3.493685  2.262742
min    0.750000 -4.500000
25%         NaN       NaN
50%         NaN       NaN
75%         NaN       NaN
max    7.100000 -1.300000

In [150]:
obj = Series(['a','a','b','c']*4)
obj

0     a
1     a
2     b
3     c
4     a
5     a
6     b
7     c
8     a
9     a
10    b
11    c
12    a
13    a
14    b
15    c
dtype: object

In [151]:
obj.describe()
# top : 가장 많은 값
# freq : top의 frequent

count     16
unique     3
top        a
freq       8
dtype: object

#### 상관관계

In [152]:
from pandas_datareader import data
# 외부 확장 모듈 
# cmd 창에서 > pip install pandas_datareader

In [153]:
all_data = {}
for ticker in ['AAPL' , 'IBM' , 'MSFT', 'GOOG']:
    all_data[ticker] = data.DataReader(ticker, 'yahoo' , '2015-01-01' , '2016-01-01')
all_data

{'AAPL':                   Open        High         Low       Close     Volume  \
 Date
 2015-01-02  111.389999  111.440002  107.349998  109.330002   53204600
 2015-01-05  108.290001  108.650002  105.410004  106.250000   64285500
 2015-01-06  106.540001  107.430000  104.629997  106.260002   65797100
 2015-01-07  107.199997  108.199997  106.699997  107.750000   40105900
 2015-01-08  109.230003  112.150002  108.699997  111.889999   59364500
 2015-01-09  112.669998  113.250000  110.209999  112.010002   53699500
 2015-01-12  112.599998  112.629997  108.800003  109.250000   49650800
 2015-01-13  111.430000  112.800003  108.910004  110.220001   67091900
 2015-01-14  109.040001  110.489998  108.500000  109.800003   48337000
 2015-01-15  110.000000  110.059998  106.660004  106.820000   60014000
 2015-01-16  107.029999  107.580002  105.199997  105.989998   78513300
 2015-01-20  107.839996  108.970001  106.500000  108.720001   49899900
 2015-01-21  108.949997  111.059998  108.269997  109.550003   48575900
 2015-01-22  110.260002  112.470001  109.720001  112.400002   53796400
 2015-01-23  112.300003  113.750000  111.529999  112.980003   46464800
 2015-01-26  113.739998  114.360001  112.800003  113.099998   55615000
 2015-01-27  112.419998  112.480003  109.029999  109.139999   95568700
 2015-01-28  117.629997  118.120003  115.309998  115.309998  146477100
 2015-01-29  116.320000  119.190002  115.559998  118.900002   84436400
 2015-01-30  118.400002  120.000000  116.849998  117.160004   83745500
 2015-02-02  118.050003  119.169998  116.080002  118.629997   62739100
 2015-02-03  118.500000  119.089996  117.610001  118.650002   51915700
 2015-02-04  118.500000  120.510002  118.309998  119.559998   70149700
 2015-02-05  120.019997  120.230003  119.250000  119.940002   42246200
 2015-02-06  120.019997  120.250000  118.449997  118.930000   43706600
 2015-02-09  118.550003  119.839996  118.430000  119.720001   38889800
 2015-02-10  120.169998  122.150002  120.160004  122.019997   62008500
 2015-02-11  122.769997  124.919998  122.500000  124.879997   73561800
 2015-02-12  126.059998  127.480003  125.570000  126.459999   74474500
 2015-02-13  127.279999  127.279999  125.650002  127.080002   54272200
 ...                ...         ...         ...         ...        ...
 2015-11-18  115.760002  117.489998  115.500000  117.290001   46674700
 2015-11-19  117.639999  119.750000  116.760002  118.779999   43295800
 2015-11-20  119.199997  119.919998  118.849998  119.300003   34287100
 2015-11-23  119.269997  119.730003  117.339996  117.750000   32482500
 2015-11-24  117.330002  119.349998  117.120003  118.879997   42803200
 2015-11-25  119.209999  119.230003  117.919998  118.029999   21388300
 2015-11-27  118.290001  118.410004  117.599998  117.809998   13046400
 2015-11-30  117.989998  119.410004  117.750000  118.300003   39180300
 2015-12-01  118.750000  118.809998  116.860001  117.339996   34852400
 2015-12-02  117.339996  118.110001  116.080002  116.279999   33386600
 2015-12-03  116.550003  116.790001  114.220001  115.199997   41569500
 2015-12-04  115.290001  119.250000  115.110001  119.029999   57777000
 2015-12-07  118.980003  119.860001  117.809998  118.279999   32084200
 2015-12-08  117.519997  118.599998  116.860001  118.230003   34309500
 2015-12-09  117.639999  117.690002  115.080002  115.620003   46361400
 2015-12-10  116.040001  116.940002  115.510002  116.169998   29104200
 2015-12-11  115.190002  115.389999  112.849998  113.180000   46886200
 2015-12-14  112.180000  112.680000  109.790001  112.480003   64318700
 2015-12-15  111.940002  112.800003  110.349998  110.489998   53323100
 2015-12-16  111.070000  111.989998  108.800003  111.339996   56238500
 2015-12-17  112.019997  112.250000  108.980003  108.980003   44772800
 2015-12-18  108.910004  109.519997  105.809998  106.029999   96453300
 2015-12-21  107.279999  107.370003  105.570000  107.330002   47590600
 2015-12-22  107.400002  107.720001  106.449997  107.230003   32789400
 2015-12-23  107.269997  108.849998  107.199997  108.610001   32657400
 2015-12-24  109.000000  109.000000  107.949997  108.029999   13570400
 2015-12-28  107.589996  107.690002  106.180000  106.820000   26704200
 2015-12-29  106.959999  109.430000  106.860001  108.739998   30931200
 2015-12-30  108.580002  108.699997  107.180000  107.320000   25213800
 2015-12-31  107.010002  107.029999  104.820000  105.260002   40635300

              Adj Close
 Date
 2015-01-02  104.704758
 2015-01-05  101.755057
 2015-01-06  101.764636
 2015-01-07  103.191599
 2015-01-08  107.156454
 2015-01-09  107.271380
 2015-01-12  104.628140
 2015-01-13  105.557105
 2015-01-14  105.154875
 2015-01-15  102.300942
 2015-01-16  101.506054
 2015-01-20  104.120563
 2015-01-21  104.915452
 2015-01-22  107.644880
 2015-01-23  108.200345
 2015-01-26  108.315263
 2015-01-27  104.522793
 2015-01-28  110.431768
 2015-01-29  113.869895
 2015-01-30  112.203509
 2015-02-02  113.611314
 2015-02-03  113.630472
 2015-02-04  114.501970
 2015-02-05  115.319223
 2015-02-06  114.348132
 2015-02-09  115.107697
 2015-02-10  117.319084
 2015-02-11  120.068900
 2015-02-12  121.588031
 2015-02-13  122.184148
 ...                ...
 2015-11-18  114.241891
 2015-11-19  115.693167
 2015-11-20  116.199658
 2015-11-23  114.689936
 2015-11-24  115.790567
 2015-11-25  114.962658
 2015-11-27  114.748374
 2015-11-30  115.225646
 2015-12-01  114.290588
 2015-12-02  113.258137
 2015-12-03  112.206202
 2015-12-04  115.936671
 2015-12-07  115.206161
 2015-12-08  115.157465
 2015-12-09  112.615293
 2015-12-10  113.150995
 2015-12-11  110.238701
 2015-12-14  109.556895
 2015-12-15  107.618605
 2015-12-16  108.446514
 2015-12-17  106.147852
 2015-12-18  103.274512
 2015-12-21  104.540731
 2015-12-22  104.443331
 2015-12-23  105.787465
 2015-12-24  105.222536
 2015-12-28  104.043982
 2015-12-29  105.914084
 2015-12-30  104.530989
 2015-12-31  102.524526

 [252 rows x 6 columns],
 'GOOG':                   Open        High         Low       Close   Volume  \
 Date
 2015-01-02  529.012399  531.272382  524.102388  524.812404  1447500
 2015-01-05  523.262377  524.332389  513.062315  513.872306  2059800
 2015-01-06  515.002358  516.177334  501.052266  501.962262  2899900
 2015-01-07  507.002299  507.246285  499.652247  501.102268  2065000
 2015-01-08  497.992268  503.482270  491.002212  502.682285  3353500
 2015-01-09  504.762300  504.922285  494.792239  496.172244  2071300
 2015-01-12  494.942247  495.978230  487.562205  492.552239  2326700
 2015-01-13  498.842256  502.982272  492.392224  496.182251  2370400
 2015-01-14  494.652237  503.232286  493.002234  500.872267  2215500
 2015-01-15  505.572291  505.682303  497.762267  501.792271  2715800
 2015-01-16  500.012273  508.192300  500.002267  508.082288  2298200
 2015-01-20  511.002313  512.502307  506.018277  506.902294  2232000
 2015-01-21  507.252283  519.282346  506.202284  518.042373  2268700
 2015-01-22  521.482349  536.332401  519.702382  534.392388  2676900
 2015-01-23  535.592396  542.172453  533.002407  539.952437  2281700
 2015-01-26  538.532466  539.002444  529.672413  535.212448  1543700
 2015-01-27  529.972369  530.702398  518.192320  518.632370  1904000
 2015-01-28  522.782362  522.992349  510.002318  510.002318  1683800
 2015-01-29  511.002313  511.092313  501.202274  510.662300  4186300
 2015-01-30  515.862322  539.872444  515.522339  534.522445  5606300
 2015-02-02  531.732383  533.002407  518.552377  528.482381  2849800
 2015-02-03  528.002366  533.402430  523.262377  529.242400  2038600
 2015-02-04  529.242400  532.674420  521.272361  522.762349  1663600
 2015-02-05  523.792395  528.502395  522.092359  527.582391  1849700
 2015-02-06  527.642370  537.202402  526.412373  531.002415  1763500
 2015-02-09  528.002366  532.002411  526.022388  527.832406  1267700
 2015-02-10  529.302379  537.702431  526.922378  536.942412  1749800
 2015-02-11  535.302416  538.452412  533.380397  535.972405  1377700
 2015-02-12  537.252405  544.822482  534.675391  542.932472  1620200
 2015-02-13  543.352447  549.912491  543.132484  549.012501  1900300
 ...                ...         ...         ...         ...      ...
 2015-11-18  727.580017  741.409973  727.000000  740.000000  1684300
 2015-11-19  738.739990  742.000000  737.429993  738.409973  1327100
 2015-11-20  746.530029  757.919983  743.000000  756.599976  2212300
 2015-11-23  757.450012  762.708008  751.820007  755.979980  1414500
 2015-11-24  752.000000  755.278992  737.630005  748.280029  2333100
 2015-11-25  748.140015  752.000000  746.059998  748.150024  1122100
 2015-11-27  748.460022  753.409973  747.489990  750.260010   838500
 2015-11-30  748.809998  754.929993  741.270020  742.599976  2097600
 2015-12-01  747.109985  768.950012  746.700012  767.039978  2134600
 2015-12-02  768.900024  775.955017  758.960022  762.380005  2230400
 2015-12-03  766.010010  768.994995  745.630005  752.539978  2590600
 2015-12-04  753.099976  768.489990  750.000000  766.809998  2757300
 2015-12-07  767.770020  768.729980  755.090027  763.250000  1812300
 2015-12-08  757.890015  764.799988  754.200012  762.369995  1829500
 2015-12-09  759.169983  764.229980  737.000977  751.609985  2700000
 2015-12-10  752.849976  755.849976  743.830017  749.460022  1984900
 2015-12-11  741.159973  745.710022  736.750000  738.869995  2224400
 2015-12-14  741.789978  748.729980  724.169983  747.770020  2412500
 2015-12-15  753.000000  758.080017  743.010010  743.400024  2666200
 2015-12-16  750.000000  760.590027  739.434998  758.090027  1993300
 2015-12-17  762.419983  762.679993  749.000000  749.429993  1553400
 2015-12-18  746.510010  754.130005  738.150024  739.309998  3148700
 2015-12-21  746.130005  750.000000  740.000000  747.770020  1525700
 2015-12-22  751.650024  754.849976  745.530029  750.000000  1365400
 2015-12-23  753.469971  754.210022  744.000000  750.309998  1565900
 2015-12-24  749.549988  751.349976  746.619995  748.400024   527200
 2015-12-28  752.919983  762.989990  749.520020  762.510010  1515300
 2015-12-29  766.690002  779.979980  766.429993  776.599976  1765000
 2015-12-30  776.599976  777.599976  766.900024  771.000000  1293300
 2015-12-31  769.500000  769.500000  758.340027  758.880005  1489600

              Adj Close
 Date
 2015-01-02  524.812404
 2015-01-05  513.872306
 2015-01-06  501.962262
 2015-01-07  501.102268
 2015-01-08  502.682285
 2015-01-09  496.172244
 2015-01-12  492.552239
 2015-01-13  496.182251
 2015-01-14  500.872267
 2015-01-15  501.792271
 2015-01-16  508.082288
 2015-01-20  506.902294
 2015-01-21  518.042373
 2015-01-22  534.392388
 2015-01-23  539.952437
 2015-01-26  535.212448
 2015-01-27  518.632370
 2015-01-28  510.002318
 2015-01-29  510.662300
 2015-01-30  534.522445
 2015-02-02  528.482381
 2015-02-03  529.242400
 2015-02-04  522.762349
 2015-02-05  527.582391
 2015-02-06  531.002415
 2015-02-09  527.832406
 2015-02-10  536.942412
 2015-02-11  535.972405
 2015-02-12  542.932472
 2015-02-13  549.012501
 ...                ...
 2015-11-18  740.000000
 2015-11-19  738.409973
 2015-11-20  756.599976
 2015-11-23  755.979980
 2015-11-24  748.280029
 2015-11-25  748.150024
 2015-11-27  750.260010
 2015-11-30  742.599976
 2015-12-01  767.039978
 2015-12-02  762.380005
 2015-12-03  752.539978
 2015-12-04  766.809998
 2015-12-07  763.250000
 2015-12-08  762.369995
 2015-12-09  751.609985
 2015-12-10  749.460022
 2015-12-11  738.869995
 2015-12-14  747.770020
 2015-12-15  743.400024
 2015-12-16  758.090027
 2015-12-17  749.429993
 2015-12-18  739.309998
 2015-12-21  747.770020
 2015-12-22  750.000000
 2015-12-23  750.309998
 2015-12-24  748.400024
 2015-12-28  762.510010
 2015-12-29  776.599976
 2015-12-30  771.000000
 2015-12-31  758.880005

 [252 rows x 6 columns],
 'IBM':                   Open        High         Low       Close    Volume  \
 Date
 2015-01-02  161.309998  163.309998  161.000000  162.059998   5525500
 2015-01-05  161.270004  161.270004  159.190002  159.509995   4880400
 2015-01-06  159.669998  159.960007  155.169998  156.070007   6146700
 2015-01-07  157.199997  157.199997  154.029999  155.050003   4701800
 2015-01-08  156.240005  159.039993  155.550003  158.419998   4236800
 2015-01-09  158.419998  160.339996  157.250000  159.110001   4488300
 2015-01-12  159.000000  159.250000  155.759995  156.440002   4187600
 2015-01-13  157.259995  159.970001  155.679993  156.809998   4377500
 2015-01-14  154.860001  156.490005  153.740005  155.800003   4677400
 2015-01-15  156.690002  156.970001  154.160004  154.570007   4248400
 2015-01-16  153.820007  157.630005  153.820007  157.139999   5756000
 2015-01-20  156.699997  157.330002  154.029999  156.949997   8392800
 2015-01-21  153.029999  154.500000  151.070007  152.089996  11897100
 2015-01-22  151.940002  155.720001  151.759995  155.389999   6120100
 2015-01-23  155.029999  157.600006  154.889999  155.869995   4834800
 2015-01-26  158.259995  159.460007  155.770004  156.360001   7888100
 2015-01-27  154.940002  155.089996  152.589996  153.669998   5659600
 2015-01-28  154.000000  154.529999  151.550003  151.550003   4495900
 2015-01-29  151.380005  155.580002  149.520004  155.479996   8320800
 2015-01-30  153.910004  155.240005  153.039993  153.309998   6563600
 2015-02-02  154.000000  154.660004  151.509995  154.660004   4712200
 2015-02-03  154.750000  158.600006  154.750000  158.470001   5539400
 2015-02-04  157.210007  158.710007  156.699997  156.960007   3678500
 2015-02-05  157.289993  158.589996  157.149994  157.910004   5253600
 2015-02-06  157.339996  158.080002  156.229996  156.720001   3256500
 2015-02-09  156.000000  157.500000  155.399994  155.750000   3057700
 2015-02-10  156.740005  158.559998  155.080002  158.559998   4440600
 2015-02-11  157.759995  159.089996  157.169998  158.199997   3626700
 2015-02-12  158.720001  159.500000  158.089996  158.520004   3333100
 2015-02-13  158.779999  160.800003  158.639999  160.399994   3706900
 ...                ...         ...         ...         ...       ...
 2015-11-18  134.789993  135.910004  134.259995  135.820007   4149200
 2015-11-19  136.210007  137.740005  136.009995  136.740005   4753600
 2015-11-20  137.369995  138.919998  137.250000  138.500000   5176400
 2015-11-23  138.529999  138.869995  137.119995  138.460007   5137900
 2015-11-24  137.649994  139.339996  137.309998  138.600006   3407700
 2015-11-25  138.369995  138.429993  137.380005  138.000000   3238200
 2015-11-27  138.000000  138.809998  137.210007  138.460007   1415800
 2015-11-30  138.610001  139.899994  138.520004  139.419998   4545600
 2015-12-01  139.580002  141.399994  139.580002  141.279999   4195100
 2015-12-02  140.929993  141.210007  139.500000  139.699997   3725400
 2015-12-03  140.100006  140.729996  138.190002  138.919998   5909600
 2015-12-04  138.089996  141.020004  137.990005  140.429993   4571600
 2015-12-07  140.160004  140.410004  138.809998  139.550003   3279400
 2015-12-08  138.279999  139.059998  137.529999  138.050003   3905200
 2015-12-09  137.380005  139.839996  136.229996  136.610001   4615000
 2015-12-10  137.029999  137.850006  135.720001  136.779999   4754800
 2015-12-11  135.229996  135.440002  133.910004  134.570007   5333800
 2015-12-14  135.309998  136.139999  134.020004  135.929993   5143800
 2015-12-15  137.399994  138.970001  137.279999  137.789993   4238500
 2015-12-16  139.119995  139.649994  137.789993  139.289993   4345500
 2015-12-17  139.350006  139.500000  136.309998  136.750000   4089500
 2015-12-18  136.410004  136.960007  134.270004  134.899994  10026100
 2015-12-21  135.830002  135.830002  134.020004  135.500000   5617500
 2015-12-22  135.880005  138.190002  135.649994  137.929993   4263800
 2015-12-23  138.300003  139.309998  138.110001  138.539993   5164900
 2015-12-24  138.429993  138.880005  138.110001  138.250000   1495200
 2015-12-28  137.740005  138.039993  136.539993  137.610001   3143400
 2015-12-29  138.250000  140.059998  138.199997  139.779999   3943700
 2015-12-30  139.580002  140.440002  139.220001  139.339996   2989400
 2015-12-31  139.070007  139.100006  137.570007  137.619995   3443300

              Adj Close
 Date
 2015-01-02  149.988688
 2015-01-05  147.628626
 2015-01-06  144.444872
 2015-01-07  143.500844
 2015-01-08  146.619820
 2015-01-09  147.258426
 2015-01-12  144.787307
 2015-01-13  145.129743
 2015-01-14  144.194979
 2015-01-15  143.056602
 2015-01-16  145.435164
 2015-01-20  145.259314
 2015-01-21  140.761319
 2015-01-22  143.815515
 2015-01-23  144.259758
 2015-01-26  144.713264
 2015-01-27  142.223631
 2015-01-28  140.261548
 2015-01-29  143.898808
 2015-01-30  141.890446
 2015-02-02  143.139895
 2015-02-03  146.666098
 2015-02-04  145.268578
 2015-02-05  146.147813
 2015-02-06  146.063926
 2015-02-09  145.159879
 2015-02-10  147.778813
 2015-02-11  147.443290
 2015-02-12  147.741539
 2015-02-13  149.493700
 ...                ...
 2015-11-18  129.808084
 2015-11-19  130.687360
 2015-11-20  132.369450
 2015-11-23  132.331227
 2015-11-24  132.465029
 2015-11-25  131.891582
 2015-11-27  132.331227
 2015-11-30  133.248725
 2015-12-01  135.026395
 2015-12-02  133.516330
 2015-12-03  132.770857
 2015-12-04  134.214014
 2015-12-07  133.372976
 2015-12-08  131.939372
 2015-12-09  130.563109
 2015-12-10  130.725583
 2015-12-11  128.613414
 2015-12-14  129.913201
 2015-12-15  131.690871
 2015-12-16  133.124475
 2015-12-17  130.696912
 2015-12-18  128.928794
 2015-12-21  129.502242
 2015-12-22  131.824673
 2015-12-23  132.407673
 2015-12-24  132.130516
 2015-12-28  131.518845
 2015-12-29  133.592791
 2015-12-30  133.172265
 2015-12-31  131.528398

 [252 rows x 6 columns],
 'MSFT':                  Open       High        Low      Close     Volume  Adj Close
 Date
 2015-01-02  46.660000  47.419998  46.540001  46.759998   27913900  44.038037
 2015-01-05  46.369999  46.730000  46.250000  46.330002   39673900  43.633071
 2015-01-06  46.380001  46.750000  45.540001  45.650002   36447900  42.992654
 2015-01-07  45.980000  46.459999  45.490002  46.230000   29114100  43.538890
 2015-01-08  46.750000  47.750000  46.720001  47.590000   29645200  44.819723
 2015-01-09  47.610001  47.820000  46.900002  47.189999   23944200  44.443006
 2015-01-12  47.419998  47.540001  46.360001  46.599998   23651900  43.887351
 2015-01-13  46.970001  47.910000  46.060001  46.360001   35270600  43.661323
 2015-01-14  45.959999  46.240002  45.619999  45.959999   29675300  43.284607
 2015-01-15  46.220001  46.380001  45.410000  45.480000   32750800  42.832548
 2015-01-16  45.310001  46.279999  45.169998  46.240002   35695300  43.548310
 2015-01-20  46.299999  46.650002  45.570000  46.389999   36161900  43.689576
 2015-01-21  45.939999  46.139999  45.480000  45.919998   39081100  43.246934
 2015-01-22  46.380001  47.139999  46.080002  47.130001   35898000  44.386501
 2015-01-23  47.360001  47.389999  46.799999  47.180000   26211600  44.433590
 2015-01-26  47.000000  47.130001  46.240002  47.009998   42525500  44.273484
 2015-01-27  42.950001  43.200001  42.110001  42.660000  169164000  40.176705
 2015-01-28  42.740002  42.790001  41.160000  41.189999   84507100  38.792274
 2015-01-29  40.930000  42.119999  40.790001  42.009998   63585300  39.564541
 2015-01-30  41.549999  41.580002  40.349998  40.400002   78004900  38.048264
 2015-02-02  40.590000  41.369999  40.230000  41.279999   50352500  38.877035
 2015-02-03  41.630001  41.930000  41.049999  41.599998   52082400  39.178407
 2015-02-04  41.939999  42.209999  41.360001  41.840000   41614800  39.404438
 2015-02-05  42.220001  42.639999  41.860001  42.450001   36548200  39.978930
 2015-02-06  42.680000  42.790001  42.150002  42.410000   34616600  39.941257
 2015-02-09  42.240002  42.740002  42.209999  42.360001   31381100  39.894169
 2015-02-10  42.740002  42.770000  42.180000  42.599998   29670700  40.120196
 2015-02-11  42.650002  42.650002  42.209999  42.380001   38262500  39.913005
 2015-02-12  42.660000  43.090000  42.509998  43.090000   33268800  40.581674

In [154]:
price = DataFrame({tic: data['Adj Close'] for tic , data in all_data.items()})
volume = DataFrame({tic: data['Volume'] for tic , data in all_data.items()})

In [155]:
returns = price.pct_change() # 데이터셋 저장

In [156]:
returns.tail() # 뒷부분만 가져오기

                AAPL      GOOG       IBM      MSFT
Date
2015-12-24 -0.005340 -0.002546 -0.002093 -0.002687
2015-12-28 -0.011201  0.018854 -0.004629  0.005030
2015-12-29  0.017974  0.018478  0.015769  0.010724
2015-12-30 -0.013059 -0.007211 -0.003148 -0.004244
2015-12-31 -0.019195 -0.015720 -0.012344 -0.014740

In [157]:
returns.MSFT.corr(returns.IBM)  # corr 메서드는 NA가 아니고 정렬된 색인에서 연속하는 두 시리즈에 대해 상관관계를 계산

0.54925482075995335

In [158]:
returns.MSFT.cov(returns.IBM) # 공분산을 계산

0.00013047519609578811

In [159]:
# 데이터 프레임 내에서 상관관계 계산
returns.corr()

          AAPL      GOOG       IBM      MSFT
AAPL  1.000000  0.379946  0.516671  0.523573
GOOG  0.379946  1.000000  0.451687  0.520562
IBM   0.516671  0.451687  1.000000  0.549255
MSFT  0.523573  0.520562  0.549255  1.000000

In [160]:
# 데이터 프레임 내에서 공분산을 계산 
returns.cov()

          AAPL      GOOG       IBM      MSFT
AAPL  0.000284  0.000119  0.000116  0.000157
GOOG  0.000119  0.000347  0.000112  0.000173
IBM   0.000116  0.000112  0.000178  0.000130
MSFT  0.000157  0.000173  0.000130  0.000317

In [161]:
# corrwith 메서드를 이용하면 다른 Series나 Dataframe과의 상관관계를 계산한다.
returns.corrwith(returns.IBM)

AAPL    0.516671
GOOG    0.451687
IBM     1.000000
MSFT    0.549255
dtype: float64

In [162]:
# 시가 총액의 퍼센트 변화율에 대한 상관관계 계산 
returns.corrwith(volume)

AAPL   -0.119290
GOOG    0.405238
IBM    -0.297049
MSFT   -0.003517
dtype: float64

In [163]:
obj = pd.Series(['c','a','d','a','a','b','b','c','c'])
obj

0    c
1    a
2    d
3    a
4    a
5    b
6    b
7    c
8    c
dtype: object

In [164]:
# R 에서의 unique SQL 의 distict 값과 같은 유일값 추출하는것
obj.unique()

array(['c', 'a', 'd', 'b'], dtype=object)

In [165]:
# 데이터의 개수 카운트. 값에 따라 내림차순 정렬 (동일한 값끼리는 index 오름차순 정렬)
obj.value_counts()

a    3
c    3
b    2
d    1
dtype: int64

In [166]:
# sort = False 하면 원래 index 순서로 출력
pd.value_counts(obj.values, sort=False)

d    1
c    3
a    3
b    2
dtype: int64

In [167]:
mask =obj.isin(['b','c']) # boolean vector를 반환

In [168]:
mask # indexing에 이용

0     True
1    False
2    False
3    False
4    False
5     True
6     True
7     True
8     True
dtype: bool

In [169]:
data = DataFrame({'Qu1' : [1,3,4,3,4],
                  'Qu2' : [2,3,1,2,3],
                  'Qu3' : [1,5,2,4,4]})

In [170]:
data

   Qu1  Qu2  Qu3
0    1    2    1
1    3    3    5
2    4    1    2
3    3    2    4
4    4    3    4

In [171]:
result = data.apply(pd.value_counts) # 값이 index로, counts가 값으로 들어간다. (index=행=특정숫자, cells=특정숫자의 해당 열 출현횟수)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  NaN  2.0  1.0
3  2.0  2.0  NaN
4  2.0  NaN  2.0
5  NaN  NaN  1.0

In [172]:
result = data.apply(pd.value_counts).fillna(0)
result

   Qu1  Qu2  Qu3
1  1.0  1.0  1.0
2  0.0  2.0  1.0
3  2.0  2.0  0.0
4  2.0  0.0  2.0
5  0.0  0.0  1.0

## 누락된 데이터 처리하기

In [173]:
string_data = Series(['aardvark' , 'artichoke' , np.nan , 'avocado'])

In [174]:
string_data

0     aardvark
1    artichoke
2          NaN
3      avocado
dtype: object

In [175]:
string_data.isnull()

0    False
1    False
2     True
3    False
dtype: bool

In [176]:
string_data[0] = None # ==NaN

In [177]:
string_data.isnull()

0     True
1    False
2     True
3    False
dtype: bool

In [178]:
string_data.dropna()  # NaN 값을 제거한 나머지 값들을 return한다.

1    artichoke
3      avocado
dtype: object

In [179]:
string_data.notnull()  # is.null 과 반대되는 개념

0    False
1     True
2    False
3     True
dtype: bool

In [180]:
from numpy import nan as NA # np.nan 써야되는 것들을 NA라고 쓰겠다.

In [181]:
data = Series([1, NA, 3.5 ,NA , 7])

In [182]:
data.dropna()

0    1.0
2    3.5
4    7.0
dtype: float64

In [183]:
data[data.notnull()] # Boolean Series(마스크)를 이용해 인덱싱

0    1.0
2    3.5
4    7.0
dtype: float64

In [184]:
data = DataFrame([[1., 6.5,3.] , [1. , NA , NA] , [NA,NA,NA] , [NA,6.5,3.]]) 
data

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [185]:
data.dropna() # default : how='any'

     0    1    2
0  1.0  6.5  3.0

In [186]:
data.dropna(how = 'any') # 하나라도 NA값이면 제거

     0    1    2
0  1.0  6.5  3.0

In [187]:
data.dropna(how = 'all') # 모든 값이 NA값 일때만 제거

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
3  NaN  6.5  3.0

In [188]:
data[4] = NA
data

     0    1    2   4
0  1.0  6.5  3.0 NaN
1  1.0  NaN  NaN NaN
2  NaN  NaN  NaN NaN
3  NaN  6.5  3.0 NaN

In [189]:
data.dropna(axis= 1 , how = 'all')

     0    1    2
0  1.0  6.5  3.0
1  1.0  NaN  NaN
2  NaN  NaN  NaN
3  NaN  6.5  3.0

In [190]:
df = DataFrame(np.random.randn(7,3))  # 데이터 프레임에 7행 3열의 랜덤 난수 형성
df

          0         1         2
0  0.985618  0.694824  0.630205
1 -0.858641  0.569128 -0.749336
2  1.745777  0.052133 -1.140702
3 -0.967099 -0.458111 -1.635921
4 -0.258250  0.831682 -0.155711
5  0.430675 -0.054180  0.167904
6  1.887305 -0.281856  1.556681

In [191]:
df.ix[:4, 1] = NA # 여기서 4는 position이 아닌 label. 그래서 0~4까지 NaN 할당되었다.
df

          0         1         2
0  0.985618       NaN  0.630205
1 -0.858641       NaN -0.749336
2  1.745777       NaN -1.140702
3 -0.967099       NaN -1.635921
4 -0.258250       NaN -0.155711
5  0.430675 -0.054180  0.167904
6  1.887305 -0.281856  1.556681

In [192]:
df.ix[:2,2] = NA
df

          0         1         2
0  0.985618       NaN       NaN
1 -0.858641       NaN       NaN
2  1.745777       NaN       NaN
3 -0.967099       NaN -1.635921
4 -0.258250       NaN -0.155711
5  0.430675 -0.054180  0.167904
6  1.887305 -0.281856  1.556681

In [193]:
df.dropna(thresh= 3) # 3개 이상의 값이 들어있는 index만 살펴보겠다.

          0         1         2
5  0.430675 -0.054180  0.167904
6  1.887305 -0.281856  1.556681

### 누락된 값 채우기

In [194]:
df

          0         1         2
0  0.985618       NaN       NaN
1 -0.858641       NaN       NaN
2  1.745777       NaN       NaN
3 -0.967099       NaN -1.635921
4 -0.258250       NaN -0.155711
5  0.430675 -0.054180  0.167904
6  1.887305 -0.281856  1.556681

In [195]:
df.fillna(0)

          0         1         2
0  0.985618  0.000000  0.000000
1 -0.858641  0.000000  0.000000
2  1.745777  0.000000  0.000000
3 -0.967099  0.000000 -1.635921
4 -0.258250  0.000000 -0.155711
5  0.430675 -0.054180  0.167904
6  1.887305 -0.281856  1.556681

In [196]:
df.fillna({1:0.5 , 2:-1})  # column마다 다른 값을 채워 넣을 수 있다.

          0         1         2
0  0.985618  0.500000 -1.000000
1 -0.858641  0.500000 -1.000000
2  1.745777  0.500000 -1.000000
3 -0.967099  0.500000 -1.635921
4 -0.258250  0.500000 -0.155711
5  0.430675 -0.054180  0.167904
6  1.887305 -0.281856  1.556681

In [197]:
# fillna()는 기본적으로 새로운 객체를 반환하지만, 기존의 객체를 변경 할 수도 있다.
df.fillna(0,inplace = True)
df

          0         1         2
0  0.985618  0.000000  0.000000
1 -0.858641  0.000000  0.000000
2  1.745777  0.000000  0.000000
3 -0.967099  0.000000 -1.635921
4 -0.258250  0.000000 -0.155711
5  0.430675 -0.054180  0.167904
6  1.887305 -0.281856  1.556681

In [198]:
df = DataFrame(np.random.randn(6,3))
df

          0         1         2
0 -1.746863  1.541636  0.493072
1  1.031395 -0.220981  0.344699
2 -0.410850  0.801259 -0.422537
3  0.577414  0.648049  0.060424
4 -0.035910 -0.364458  0.690923
5 -0.421152  0.976220 -0.026237

In [199]:
df.ix[2:,1] = NA
df.ix[4:,2] = NA
df

          0         1         2
0 -1.746863  1.541636  0.493072
1  1.031395 -0.220981  0.344699
2 -0.410850       NaN -0.422537
3  0.577414       NaN  0.060424
4 -0.035910       NaN       NaN
5 -0.421152       NaN       NaN

In [200]:
df.fillna(method = 'ffill')

          0         1         2
0 -1.746863  1.541636  0.493072
1  1.031395 -0.220981  0.344699
2 -0.410850 -0.220981 -0.422537
3  0.577414 -0.220981  0.060424
4 -0.035910 -0.220981  0.060424
5 -0.421152 -0.220981  0.060424

In [201]:
df.fillna(method = 'ffill' , limit= 2) # 2개 까지만

          0         1         2
0 -1.746863  1.541636  0.493072
1  1.031395 -0.220981  0.344699
2 -0.410850 -0.220981 -0.422537
3  0.577414 -0.220981  0.060424
4 -0.035910       NaN  0.060424
5 -0.421152       NaN  0.060424

In [202]:
data = Series([1., NA, 3.5 , NA , 7])
data

0    1.0
1    NaN
2    3.5
3    NaN
4    7.0
dtype: float64

In [203]:
data.fillna(data.mean()) # NA 값에 data의 평균을 넣은 Series

0    1.000000
1    3.833333
2    3.500000
3    3.833333
4    7.000000
dtype: float64

#### fillna 함수 인자  
<ol>
<li>value : 비어있는 값을 채울 스칼라 값이나 사전 형식의 객체</li>
<li>method : 보간 방식 , 기본적으로 'ffill'을 사용한다.</li>
<li>axis :  값을 채워 넣을 축. default는 0</li>
<li>inplace : 복사본을 생성하지 않고 호출한 객체를 변경한다. default는 False</li>
<li>limits : 값을 앞 혹은 뒤에서부터 몇 개 까지 채울지를 지정한다.</li>
</ol>

cf. 앞에서 reindex에서 다룬 보간 방식을 떠올리면 다음과 같았다.(method 옵션 중)
- ffill or pad : 앞의 값으로 누락된 값을 채워 넣는다.
- bfill or backfill : 뒤의 값으로 채워 넣는다.

### 계층적 색인

#### 계층적 색인은 하나의 축에 대해 둘 이상의 색인 단계를 지정할 수 있도록 한다.

#### 실제 데이터를 다룰 때에 유용하게 활용될 때도 있지만 주로 사용하지는 않는다. (복잡해 지니까.)

In [206]:
# concatenating (연결) -> 추후 DataFrame merging 할 때 다시 다룰 내용
s1 = pd.Series([0, 1, 2, 3], index=['a', 'b', 'c', 'd'])
s2 = pd.Series([4, 5, 6], index=['c', 'd', 'e'])
s3 = pd.concat([s1, s2], keys=["one", "two"])

In [207]:
s1

a    0
b    1
c    2
d    3
dtype: int64

In [208]:
s2

c    4
d    5
e    6
dtype: int64

In [209]:
s3

one  a    0
     b    1
     c    2
     d    3
two  c    4
     d    5
     e    6
dtype: int64

In [210]:
data = Series(np.random.randn(10) , index = [['a','a','a','b','b','b','c','c','d','d'],
                                             [1,2,3,1,2,3,1,2,2,3]])
data

a  1    1.989399
   2    0.278652
   3   -1.702824
b  1   -0.348796
   2   -0.229720
   3   -1.489623
c  1   -1.681678
   2    0.176192
d  2   -1.219168
   3   -2.038232
dtype: float64

In [211]:
data['b']

1   -0.348796
2   -0.229720
3   -1.489623
dtype: float64

In [212]:
data['b':'c']

b  1   -0.348796
   2   -0.229720
   3   -1.489623
c  1   -1.681678
   2    0.176192
dtype: float64

In [213]:
data.ix[['b','d']] # 부분적 색인이 가능하다.

b  1   -0.348796
   2   -0.229720
   3   -1.489623
d  2   -1.219168
   3   -2.038232
dtype: float64

In [214]:
data

a  1    1.989399
   2    0.278652
   3   -1.702824
b  1   -0.348796
   2   -0.229720
   3   -1.489623
c  1   -1.681678
   2    0.176192
d  2   -1.219168
   3   -2.038232
dtype: float64

In [215]:
data[:, 2] # 첫번째 단계의 모든 인덱스 중에서 두번째 단계의 index=='2'인 값들만 가져와라.

a    0.278652
b   -0.229720
c    0.176192
d   -1.219168
dtype: float64

In [216]:
data

a  1    1.989399
   2    0.278652
   3   -1.702824
b  1   -0.348796
   2   -0.229720
   3   -1.489623
c  1   -1.681678
   2    0.176192
d  2   -1.219168
   3   -2.038232
dtype: float64

In [217]:
data.unstack() # 가장 하위 단계의 index들이 column으로 변환된다.

          1         2         3
a  1.989399  0.278652 -1.702824
b -0.348796 -0.229720 -1.489623
c -1.681678  0.176192       NaN
d       NaN -1.219168 -2.038232

In [218]:
data.shape

(10,)

In [219]:
data.unstack().shape

(4, 3)

In [220]:
type(data) # 기존에 Series에서

pandas.core.series.Series

In [221]:
type(data.unstack())  # DataFrame으로 변환

pandas.core.frame.DataFrame

In [222]:
data.unstack().stack() # column을 가장 하위 단계의 index들로 변환

a  1    1.989399
   2    0.278652
   3   -1.702824
b  1   -0.348796
   2   -0.229720
   3   -1.489623
c  1   -1.681678
   2    0.176192
d  2   -1.219168
   3   -2.038232
dtype: float64

In [223]:
frame = DataFrame(np.arange(12).reshape((4, 3)),
                  index=[['a', 'a', 'b', 'b'], [1, 2, 1, 2]],
                  columns=[['Ohio', 'Ohio', 'Colorado'],
                           ['Green', 'Red', 'Green']])
frame

     Ohio     Colorado
    Green Red    Green
a 1     0   1        2
  2     3   4        5
b 1     6   7        8
  2     9  10       11

In [224]:
frame.index.names = ['key1' ,'key2']
frame.columns.names= ['state', 'color']
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [225]:
frame['Ohio']

color      Green  Red
key1 key2
a    1         0    1
     2         3    4
b    1         6    7
     2         9   10

In [226]:
frame.sort_index(level='key2')

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [227]:
frame.sort_index(axis=1, level='state')

state     Colorado  Ohio
color        Green Green Red
key1 key2
a    1           2     0   1
     2           5     3   4
b    1           8     6   7
     2          11     9  10

In [228]:
frame.index # MultiIndex 구조

MultiIndex(levels=[['a', 'b'], [1, 2]],
           labels=[[0, 0, 1, 1], [0, 1, 0, 1]],
           names=['key1', 'key2'])

In [229]:
frame.columns

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

In [230]:
# DataFrame 컬럼 계층의 이름 생성하기
MultiIndex.from_arrays([['Ohio', 'Ohio', 'Colorado'], ['Green', 'Red', 'Green']],
                       names=['state', 'color'])

MultiIndex(levels=[['Colorado', 'Ohio'], ['Green', 'Red']],
           labels=[[1, 1, 0], [0, 1, 0]],
           names=['state', 'color'])

### 5.5.1 계층 순서 바꾸고 정렬하기

In [231]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [232]:
frame.swaplevel('key1', 'key2')  # key1 의 위치와 key2 의 위치가 바뀐다.

state      Ohio     Colorado
color     Green Red    Green
key2 key1
1    a        0   1        2
2    a        3   4        5
1    b        6   7        8
2    b        9  10       11

In [233]:
frame.sortlevel(1) # 단일계층에 속한 데이터를 정렬한다.

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

In [234]:
frame.sortlevel(level='key2') # column 에는 적용 안

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
b    1        6   7        8
a    2        3   4        5
b    2        9  10       11

### 5.5.2 단계별 요약 통계

In [235]:
frame

state      Ohio     Colorado
color     Green Red    Green
key1 key2
a    1        0   1        2
     2        3   4        5
b    1        6   7        8
     2        9  10       11

In [236]:
frame.sum(level='key2') # level이 key2 인 index를 기준으로 결과 출력

state  Ohio     Colorado
color Green Red    Green
key2
1         6   8       10
2        12  14       16

In [237]:
frame.sum(level = 'color' , axis = 1)

color      Green  Red
key1 key2
a    1         2    1
     2         8    4
b    1        14    7
     2        20   10

####  set_index() vs stack()

In [238]:
frame = DataFrame({'a': range(7), 'b': range(7, 0, -1),
                   'c': ['one', 'one', 'one', 'two', 'two', 'two', 'two'],
                   'd': [0, 1, 2, 0, 1, 2, 3]})
frame

   a  b    c  d
0  0  7  one  0
1  1  6  one  1
2  2  5  one  2
3  3  4  two  0
4  4  3  two  1
5  5  2  two  2
6  6  1  two  3

In [239]:
# stack()과 set_index() 비교해서 알아두기.
frame.stack() # column이 기존 index의 하위 단계로 들어가고.

0  a      0
   b      7
   c    one
   d      0
1  a      1
   b      6
   c    one
   d      1
2  a      2
   b      5
   c    one
   d      2
3  a      3
   b      4
   c    two
   d      0
4  a      4
   b      3
   c    two
   d      1
5  a      5
   b      2
   c    two
   d      2
6  a      6
   b      1
   c    two
   d      3
dtype: object

In [240]:
# 특정 column들이 기존의 index를 대체한다.
# 리스트 원소에서 앞에 있을수록 높은 단계에 위치
frame2 = frame.set_index(['c', 'd'])
frame2

       a  b
c   d
one 0  0  7
    1  1  6
    2  2  5
two 0  3  4
    1  4  3
    2  5  2
    3  6  1

In [241]:
frame.set_index(['c', 'd'], drop=False) # c,d column 그대로 유지

       a  b    c  d
c   d
one 0  0  7  one  0
    1  1  6  one  1
    2  2  5  one  2
two 0  3  4  two  0
    1  4  3  two  1
    2  5  2  two  2
    3  6  1  two  3

In [242]:
frame2.reset_index() # 기존의 데이터와는 column 순서가 다르다.

     c  d  a  b
0  one  0  0  7
1  one  1  1  6
2  one  2  2  5
3  two  0  3  4
4  two  1  4  3
5  two  2  5  2
6  two  3  6  1

## 5.6 pandas와 관련된 기타 주제

### 5.6.2 Panel 데이터 구조
#### 이 책에서 중요하게 다룰 주제는 아니지만 pandas에는 Panel 이라는 자료 구조도 있다.
#### 이는 DataFrame의 3차원 버전이라고 이해하면 된다.

In [243]:
from __future__ import division
from pandas_datareader import data as web

In [244]:
pdata = pd.Panel(dict((stk, web.get_data_yahoo(stk, '1/1/2009', '6/1/2012'))
                      for stk in ['AAPL', 'GOOG', 'MSFT', 'DELL']))

# pandas의 datareader를 통해 2009년부터 2012년 6월 1일까지
# 야후의 데이터를 불러와 3차원 자료 구조를 형성

In [245]:
pdata # 기존 4*868*6 dimensions의 데이터

<class 'pandas.core.panel.Panel'>
Dimensions: 4 (items) x 868 (major_axis) x 6 (minor_axis)
Items axis: AAPL to MSFT
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: Open to Adj Close

In [246]:
# item 축과 minor 축을 변경
pdata = pdata.swapaxes('items', 'minor')

In [247]:
pdata

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 868 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2009-01-02 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT

In [248]:
pdata['Adj Close']

                 AAPL      DELL        GOOG       MSFT
Date
2009-01-02  11.757529  10.39902  160.499779  16.401867
2009-01-05  12.253743  10.26359  163.861421  16.555156
2009-01-06  12.051629  10.68922  166.863420  16.748784
2009-01-07  11.791215  10.78596  160.844427  15.740307
2009-01-08  12.010170  10.90204  162.432840  16.232444
2009-01-09  11.735504  10.75694  157.377899  15.748375
2009-01-12  11.486750  10.30228  156.189080  15.708035
2009-01-13  11.363668  10.40869  157.003261  15.990409
2009-01-14  11.055316   9.97338  150.334921  15.401458
2009-01-15  10.802675  10.19587  149.345914  15.522475
2009-01-16  10.666638   9.93469  149.685575  15.901662
2009-01-20  10.131557   9.52840  141.234014  14.909321
2009-01-21  10.731418   9.86697  151.388865  15.635424
2009-01-22  11.447882   9.65416  153.097158  13.804031
2009-01-23  11.447882   9.80893  162.188089  13.876642
2009-01-26  11.613718   9.97338  161.773501  14.223557
2009-01-27  11.754938   9.74122  165.574702  14.247761
2009-01-28  12.204510  10.52477  174.161139  14.554338
2009-01-29  12.049038   9.62514  171.488809  14.191286
2009-01-30  11.677202   9.18983  169.096191  13.795963
2009-02-02  11.855994   9.00603  170.115172  14.384914
2009-02-03  12.046447   9.45101  170.055239  14.925457
2009-02-04  12.120296   9.47036  171.328962  15.030338
2009-02-05  12.497314   9.12212  176.683613  15.361120
2009-02-06  12.919678   9.15114  185.454867  15.861324
2009-02-09  13.281150   9.32526  189.196135  15.683832
2009-02-10  12.674811   8.86093  179.076231  15.167491
2009-02-11  12.543956   8.72550  178.841472  15.498271
2009-02-12  12.861377   8.87060  181.343964  15.538611
2009-02-13  12.847125   8.82224  178.661643  15.401458
...               ...       ...         ...        ...
2012-04-23  74.069192  15.57434  298.502008  27.976170
2012-04-24  72.589626  15.65173  300.335186  27.801974
2012-04-25  79.031329  15.88390  304.555978  28.045851
2012-04-26  78.733339  15.99030  307.428105  27.967462
2012-04-27  78.124412  15.90324  307.183354  27.854232
2012-04-30  75.660185  15.83553  302.123410  27.889073
2012-05-01  75.420503  15.86455  301.913607  27.880361
2012-05-02  75.919303  15.64689  303.327209  27.697454
2012-05-03  75.380337  15.70010  305.205309  27.662615
2012-05-04  73.233536  15.29381  298.187334  26.983243
2012-05-07  73.781574  15.30348  303.472045  26.695817
2012-05-08  73.613146  15.19708  306.089446  26.565169
2012-05-09  73.742708  15.15838  304.271262  26.791626
2012-05-10  73.916312  15.04230  306.524016  26.774206
2012-05-11  73.422694  14.91654  302.313200  27.140022
2012-05-14  72.322731  14.93589  301.698816  26.721947
2012-05-15  71.668456  14.83916  305.250263  26.485237
2012-05-16  70.749880  14.52477  314.151389  26.213459
2012-05-17  68.682111  14.45222  311.214326  26.055652
2012-05-18  68.715793  14.25875  299.900615  25.661136
2012-05-21  72.719182  14.48124  306.748784  26.081954
2012-05-22  72.160786  14.58765  300.100412  26.090721
2012-05-23  73.921494  12.08221  304.426106  25.520864
2012-05-24  73.242607  12.04351  301.528978  25.485795
2012-05-25  72.850038  12.05319  295.470050  25.477028
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  74.143041  12.24666  296.873645  25.915380
2012-05-30  75.037005  12.14992  293.821674  25.722505
2012-05-31  74.850442  11.92743  290.140354  25.591000
2012-06-01  72.681610  11.67592  285.205295  24.942239

[868 rows x 4 columns]

In [249]:
pdata.ix[: , '6/1/2012', :] 
# z축을 전부 가져오고 x축에서 12년 6월 1일의 데이터만 가져온 경우
# z축의 데이터 인덱스를 기존 데이터 프레임의 x축에 위치하는 것처럼 보여준다.

            Open        High         Low       Close       Volume   Adj Close
AAPL  569.159996  572.650009  560.520012  560.989983  130246900.0   72.681610
DELL   12.150000   12.300000   12.045000   12.070000   19397600.0   11.675920
GOOG  571.790972  572.650996  568.350996  570.981000    6138700.0  285.205295
MSFT   28.760000   28.959999   28.440001   28.450001   56634300.0   24.942239

In [250]:
pdata.ix['Adj Close', '5/22/2012':, :]

                 AAPL      DELL        GOOG       MSFT
Date
2012-05-22  72.160786  14.58765  300.100412  26.090721
2012-05-23  73.921494  12.08221  304.426106  25.520864
2012-05-24  73.242607  12.04351  301.528978  25.485795
2012-05-25  72.850038  12.05319  295.470050  25.477028
2012-05-28        NaN  12.05319         NaN        NaN
2012-05-29  74.143041  12.24666  296.873645  25.915380
2012-05-30  75.037005  12.14992  293.821674  25.722505
2012-05-31  74.850442  11.92743  290.140354  25.591000
2012-06-01  72.681610  11.67592  285.205295  24.942239

In [253]:
# 계층적 인덱스를 갖는 데이터 프레임 형식으로 변환
stacked = pdata.ix[:, '5/30/2012':, :].to_frame()

In [252]:
stacked

                        Open        High         Low       Close       Volume  \
Date       minor
2012-05-30 AAPL   569.199997  579.989990  566.559990  579.169998  132357400.0
           DELL    12.590000   12.700000   12.460000   12.560000   19787800.0
           GOOG   588.161028  591.901014  583.530999  588.230992    3827600.0
           MSFT    29.350000   29.480000   29.120001   29.340000   41585500.0
2012-05-31 AAPL   580.740021  581.499985  571.460022  577.730019  122918600.0
           DELL    12.530000   12.540000   12.330000   12.330000   19955600.0
           GOOG   588.720982  590.001032  579.001013  580.860990    5958800.0
           MSFT    29.299999   29.420000   28.940001   29.190001   39134000.0
2012-06-01 AAPL   569.159996  572.650009  560.520012  560.989983  130246900.0
           DELL    12.150000   12.300000   12.045000   12.070000   19397600.0
           GOOG   571.790972  572.650996  568.350996  570.981000    6138700.0
           MSFT    28.760000   28.959999   28.440001   28.450001   56634300.0

                   Adj Close
Date       minor
2012-05-30 AAPL    75.037005
           DELL    12.149920
           GOOG   293.821674
           MSFT    25.722505
2012-05-31 AAPL    74.850442
           DELL    11.927430
           GOOG   290.140354
           MSFT    25.591000
2012-06-01 AAPL    72.681610
           DELL    11.675920
           GOOG   285.205295
           MSFT    24.942239

In [254]:
# panel 형식으로 변환
stacked.to_panel()

<class 'pandas.core.panel.Panel'>
Dimensions: 6 (items) x 3 (major_axis) x 4 (minor_axis)
Items axis: Open to Adj Close
Major_axis axis: 2012-05-30 00:00:00 to 2012-06-01 00:00:00
Minor_axis axis: AAPL to MSFT